blog/nix-en.org
#+TITLE: Haskell Development with Nix and Dante
#+DATE: 2018-01-10
#+AUTHOR: Colin

I recently learned enough about Nix to try it for my everyday Haskell development.
Below describes my entire setup and workflow.

* Initial Setup

I'm on Arch Linux and so reached for the ~nix~ package in the AUR first, but it
doesn't seem to set up the Nix environment properly. The [[https://nixos.org/nix/manual/#chap-quick-start][official install method]]
mostly worked:

#+BEGIN_SRC bash
curl https://nixos.org/nix/install | sh
#+END_SRC

You may have to manually fiddle with the write permissions of the newly created
~/nix~ directory usind ~chmod~.

To view a script that sets environment variables:

#+BEGIN_SRC bash
less /home/colin/.nix-profile/etc/profile.d/nix.sh
#+END_SRC

This script assumes Bash, and I use ~fish~, so I've set the following
the variables myself in my ~/home/colin/.config/fish/config.fish~:

#+BEGIN_SRC fish
set -x PATH ... '/home/colin/.nix-profile/bin'

# Nix
set -x NIX_PATH 'nixpkgs=/home/colin/.nix-defexpr/channels/nixpkgs'
set -x NIX_SSL_CERT_FILE '/etc/ssl/certs/ca-certificates.crt'
#+END_SRC

The last line is distribution specific, so make sure to check what's right
for you in the ~nix.sh~ script mentioned above.

* Haskell Specifics

In general, [[https://github.com/Gabriel439/haskell-nix][Gabriel Gonzales' beginner guide]] is good for understanding how to
structure typical project config.

I've ignored ~tinc~ and ~styx~, two third-party tools for Haskell/Nix integration,
since I wanted the vanilla experience.

The advice here otherwise assumes a straight-forward Haskell project - a single simple
library or executable without multiple subprojects or dependency overrides.
It demonstrates how to benchmark, profile, integrate with Travis, and integrate
with Emacs/Spacemacs.

** Auto-generate Nix Config

~cabal2nix~ can be used to generate nix expressions from ~.cabal~ files.
This can be installed via:

#+BEGIN_SRC bash
nix-env -i cabal2nix
#+END_SRC

Then to generate a nixified version of a ~.cabal~ file (we'll need to do this
every time our ~.cabal~ changes):

#+BEGIN_SRC bash
cabal2nix . > default.nix
#+END_SRC

If you prefer ~hpack~, grab it via:

#+BEGIN_SRC bash
nix-env --install --attr nixpkgs.haskellPackages.hpack
#+END_SRC

And generate our ~default.nix~ via:

#+BEGIN_SRC bash
hpack && cabal2nix . > default.nix
#+END_SRC

or in ~fish~:

#+BEGIN_SRC fish
hpack; cabal2nix . > default.nix
#+END_SRC

** Developing in a Nix Shell

A full nix-based project is defined by three files:

- ~default.nix~
- ~shell.nix~
- ~release.nix~

But only the first two are needed for usual development.
The command ~nix-shell~ invokes a jailed environment where all our project's
dependencies are visible to ~cabal~, so we can ~cabal test~ and ~cabal bench~
as usual. The following ~shell.nix~ file will allow ~nix-shell~ to load all
necessary dependencies:

#+BEGIN_SRC nix
let nixpkgs = import <nixpkgs> {};
    orig = nixpkgs.pkgs.haskellPackages.callPackage ./default.nix {};
in (nixpkgs.pkgs.haskell.lib.doBenchmark orig).env
#+END_SRC

Notice that provided we have a ~default.nix~ (which is the usual name for the
file output by ~cabal2nix~), there is nothing project-specific about this.
So, this snippet can be safely cargo-culted around to our various projects.

Without the ~doBenchmark~ line, our benchmark dependencies would not be visible
inside the Nix Shell.

** Defining a ~release.nix~

Generally necessary for Travis, and for actually installing your package
into some Nix store. Assuming a package called ~vectortiles~:

#+BEGIN_SRC nix
let
  config = {
    packageOverrides = pkgs: {
      haskellPackages = pkgs.haskellPackages.override {
        overrides = haskellPackagesNew: haskellPackagesOld: {
          vectortiles = haskellPackagesNew.callPackage ./default.nix { };
        };
      };
    };
  };

  pkgs =
    import <nixpkgs> { inherit config; };

in
  { vectortiles = pkgs.haskellPackages.vectortiles;
  }
#+END_SRC

There are shorter forms, but this one allows for easy overriding of specific
settings or dependencies, [[https://github.com/Gabriel439/haskell-nix/blob/master/project1/README.md#changing-versions][should we need to do that.]]

To build some full project:

#+BEGIN_SRC bash
nix-build release.nix
#+END_SRC

To build some "sub-derivation" within a larger, composite project:

#+BEGIN_SRC bash
nix-build --attr my-subproject release.nix
#+END_SRC

There are a number of other ways to customize a Haskell build, which are [[https://github.com/NixOS/nixpkgs/blob/master/pkgs/development/haskell-modules/lib.nix][listed here]].

