blog/nix-en.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-02-22 Thu 15:41 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Haskell Development with Nix and Dante</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Colin" />
<link rel="stylesheet" type="text/css" href="../assets/org-theme.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Haskell Development with Nix and Dante</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3819c30">1. Initial Setup</a></li>
<li><a href="#org91df1a6">2. Haskell Specifics</a>
<ul>
<li><a href="#org79a644c">2.1. Auto-generate Nix Config</a></li>
<li><a href="#org994d6fb">2.2. Developing in a Nix Shell</a></li>
<li><a href="#orgf4c80b6">2.3. Defining a <code>release.nix</code></a></li>
<li><a href="#orgc7fbdab">2.4. Profiling</a></li>
</ul>
</li>
<li><a href="#org5a2e5f4">3. Emacs Integration</a>
<ul>
<li><a href="#org93d0df9">3.1. Installing <code>Dante</code></a></li>
<li><a href="#org6423e39">3.2. Getting Dante to work with Test and Benchmark suites</a></li>
</ul>
</li>
<li><a href="#org5ace153">4. CI Services</a>
<ul>
<li><a href="#org77267d0">4.1. Travis</a></li>
<li><a href="#org8724f6b">4.2. Hercules</a></li>
<li><a href="#orgf777bc9">4.3. CircleCI</a></li>
<li><a href="#orga0d026c">4.4. Self-run Hydra</a></li>
</ul>
</li>
<li><a href="#org1df93a0">5. Comparison to Stack</a></li>
<li><a href="#org6fdb67e">6. Resources</a></li>
</ul>
</div>
</div>
<p>
I recently learned enough about Nix to try it for my everyday Haskell development.
Below describes my entire setup and workflow.
</p>

<div id="outline-container-org3819c30" class="outline-2">
<h2 id="org3819c30"><span class="section-number-2">1</span> Initial Setup</h2>
<div class="outline-text-2" id="text-1">
<p>
I'm on Arch Linux and so reached for the <code>nix</code> package in the AUR first, but it
doesn't seem to set up the Nix environment properly. The <a href="https://nixos.org/nix/manual/#chap-quick-start">official install method</a>
mostly worked:
</p>

<div class="org-src-container">
<pre class="src src-bash">curl https://nixos.org/nix/install | sh
</pre>
</div>

<p>
You may have to manually fiddle with the write permissions of the newly created
<code>/nix</code> directory usind <code>chmod</code>.
</p>

<p>
To view a script that sets environment variables:
</p>

<div class="org-src-container">
<pre class="src src-bash">less /home/colin/.nix-profile/etc/profile.d/nix.sh
</pre>
</div>

<p>
This script assumes Bash, and I use <code>fish</code>, so I've set the following
the variables myself in my <code>/home/colin/.config/fish/config.fish</code>:
</p>

<div class="org-src-container">
<pre class="src src-fish">set -x PATH ... '/home/colin/.nix-profile/bin'

# Nix
set -x NIX_PATH 'nixpkgs=/home/colin/.nix-defexpr/channels/nixpkgs'
set -x NIX_SSL_CERT_FILE '/etc/ssl/certs/ca-certificates.crt'
</pre>
</div>

<p>
The last line is distribution specific, so make sure to check what's right
for you in the <code>nix.sh</code> script mentioned above.
</p>
</div>
</div>

<div id="outline-container-org91df1a6" class="outline-2">
<h2 id="org91df1a6"><span class="section-number-2">2</span> Haskell Specifics</h2>
<div class="outline-text-2" id="text-2">
<p>
In general, <a href="https://github.com/Gabriel439/haskell-nix">Gabriel Gonzales' beginner guide</a> is good for understanding how to
structure typical project config.
</p>

<p>
I've ignored <code>tinc</code> and <code>styx</code>, two third-party tools for Haskell/Nix integration,
since I wanted the vanilla experience.
</p>

<p>
The advice here otherwise assumes a straight-forward Haskell project - a single simple
library or executable without multiple subprojects or dependency overrides.
It demonstrates how to benchmark, profile, integrate with Travis, and integrate
with Emacs/Spacemacs.
</p>
</div>

<div id="outline-container-org79a644c" class="outline-3">
<h3 id="org79a644c"><span class="section-number-3">2.1</span> Auto-generate Nix Config</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<code>cabal2nix</code> can be used to generate nix expressions from <code>.cabal</code> files.
This can be installed via:
</p>

<div class="org-src-container">
<pre class="src src-bash">nix-env -i cabal2nix
</pre>
</div>

<p>
Then to generate a nixified version of a <code>.cabal</code> file (we'll need to do this
every time our <code>.cabal</code> changes):
</p>

<div class="org-src-container">
<pre class="src src-bash">cabal2nix . &gt; default.nix
</pre>
</div>

<p>
If you prefer <code>hpack</code>, grab it via:
</p>

<div class="org-src-container">
<pre class="src src-bash">nix-env --install --attr nixpkgs.haskellPackages.hpack
</pre>
</div>

<p>
And generate our <code>default.nix</code> via:
</p>

<div class="org-src-container">
<pre class="src src-bash">hpack &amp;&amp; cabal2nix . &gt; default.nix
</pre>
</div>

<p>
or in <code>fish</code>:
</p>

<div class="org-src-container">
<pre class="src src-fish">hpack; cabal2nix . &gt; default.nix
</pre>
</div>
</div>
</div>

<div id="outline-container-org994d6fb" class="outline-3">
<h3 id="org994d6fb"><span class="section-number-3">2.2</span> Developing in a Nix Shell</h3>
<div class="outline-text-3" id="text-2-2">
<p>
A full nix-based project is defined by three files:
</p>

<ul class="org-ul">
<li><code>default.nix</code></li>
<li><code>shell.nix</code></li>
<li><code>release.nix</code></li>
</ul>

<p>
But only the first two are needed for usual development.
The command <code>nix-shell</code> invokes a jailed environment where all our project's
dependencies are visible to <code>cabal</code>, so we can <code>cabal test</code> and <code>cabal bench</code>
as usual. The following <code>shell.nix</code> file will allow <code>nix-shell</code> to load all
necessary dependencies:
</p>

<div class="org-src-container">
<pre class="src src-nix"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">nixpkgs</span> = <span style="color: #3a81c3;">import</span> <span style="color: #4e3163;">&lt;nixpkgs&gt;</span> <span style="color: #3a81c3;">{}</span>;
    <span style="color: #715ab1;">orig</span> = nixpkgs.pkgs.haskellPackages.callPackage <span style="color: #4e3163;">./default.nix</span> <span style="color: #3a81c3;">{}</span>;
<span style="color: #3a81c3; font-weight: bold;">in</span> <span style="color: #3a81c3;">(</span>nixpkgs.pkgs.haskell.lib.doBenchmark orig<span style="color: #3a81c3;">)</span>.env
</pre>
</div>

<p>
Notice that provided we have a <code>default.nix</code> (which is the usual name for the
file output by <code>cabal2nix</code>), there is nothing project-specific about this.
So, this snippet can be safely cargo-culted around to our various projects.
</p>

<p>
Without the <code>doBenchmark</code> line, our benchmark dependencies would not be visible
inside the Nix Shell.
</p>
</div>
</div>

<div id="outline-container-orgf4c80b6" class="outline-3">
<h3 id="orgf4c80b6"><span class="section-number-3">2.3</span> Defining a <code>release.nix</code></h3>
<div class="outline-text-3" id="text-2-3">
<p>
Generally necessary for Travis, and for actually installing your package
into some Nix store. Assuming a package called <code>vectortiles</code>:
</p>

<div class="org-src-container">
<pre class="src src-nix"><span style="color: #3a81c3; font-weight: bold;">let</span>
  <span style="color: #715ab1;">config</span> = <span style="color: #3a81c3;">{</span>
    <span style="color: #715ab1;">packageOverrides</span> = pkgs: <span style="color: #6c3163;">{</span>
      <span style="color: #715ab1;">haskellPackages</span> = pkgs.haskellPackages.override <span style="color: #2d9574;">{</span>
        <span style="color: #715ab1;">overrides</span> = haskellPackagesNew: haskellPackagesOld: <span style="color: #67b11d;">{</span>
          <span style="color: #715ab1;">vectortiles</span> = haskellPackagesNew.callPackage <span style="color: #4e3163;">./default.nix</span> <span style="color: #b1951d;">{</span> <span style="color: #b1951d;">}</span>;
        <span style="color: #67b11d;">}</span>;
      <span style="color: #2d9574;">}</span>;
    <span style="color: #6c3163;">}</span>;
  <span style="color: #3a81c3;">}</span>;

  <span style="color: #715ab1;">pkgs</span> =
    <span style="color: #3a81c3;">import</span> <span style="color: #4e3163;">&lt;nixpkgs&gt;</span> <span style="color: #3a81c3;">{</span> <span style="color: #3a81c3; font-weight: bold;">inherit</span> config; <span style="color: #3a81c3;">}</span>;

<span style="color: #3a81c3; font-weight: bold;">in</span>
  <span style="color: #3a81c3;">{</span> <span style="color: #715ab1;">vectortiles</span> = pkgs.haskellPackages.vectortiles;
  <span style="color: #3a81c3;">}</span>
</pre>
</div>

<p>
There are shorter forms, but this one allows for easy overriding of specific
settings or dependencies, <a href="https://github.com/Gabriel439/haskell-nix/blob/master/project1/README.md#changing-versions">should we need to do that.</a>
</p>

<p>
To build some full project:
</p>

<div class="org-src-container">
<pre class="src src-bash">nix-build release.nix
</pre>
</div>

<p>
To build some "sub-derivation" within a larger, composite project:
</p>

<div class="org-src-container">
<pre class="src src-bash">nix-build --attr my-subproject release.nix
</pre>
</div>

<p>
There are a number of other ways to customize a Haskell build, which are <a href="https://github.com/NixOS/nixpkgs/blob/master/pkgs/development/haskell-modules/lib.nix">listed here</a>.
</p>
</div>
</div>
