blog/nix-en.org
** Profiling

Nix makes this fairly easy. First, we add the following to a
~/home/YOU/.config/nixpkgs/config.nix~:

#+BEGIN_SRC nix
{
  packageOverrides = super: let self = super.pkgs; in
  {
    profiledHaskellPackages = self.haskellPackages.override {
      overrides = self: super: {
        mkDerivation = args: super.mkDerivation (args // {
          enableLibraryProfiling = true;
        });
      };
    };
  };
}
#+END_SRC

Now in the project we want to profile, we create a new ~profiling-shell.nix~:

#+BEGIN_SRC nix
let nixpkgs = import <nixpkgs> {};
    orig = nixpkgs.pkgs.profiledHaskellPackages.callPackage ./default.nix {};
in (nixpkgs.pkgs.haskell.lib.doBenchmark orig).env
#+END_SRC

Almost identical to our normal ~shell.nix~, except for the usage of
~profiledHaskellPackages~, which we just defined globally.
Now, an invocation of ~nix-shell profiling-shell.nix~ will rebuild /every/
dependency in our project with profiling enabled. The first time this is done
it will take quite a long time. Luckily this doesn't corrupt our Nix store -
a vanilla ~nix-shell~ does seem to present us with our regular dependencies
again, without redownloading or rebuilding.

*WARNING:* A ~nix-collect-garbage -d~ will wipe away all the custom-built
libs from our Nix Store, and we'd have to build them again if they're needed.

If we're writing a library, the closest executable on hand that we could profile
would be our benchmark suite. To do that:

- Add ~-prof~ and ~-fprof-auto~ to our benchmark's GHC options
- Regenerate ~default.nix~
- Enter our profiling shell: ~nix-shell profiling-shell.nix~
- ~cabal configure --enable-library-profiling --enable-benchmarks~
- ~cabal build~
- ~dist/build/projname/projname-bench +RTS -p~
- Look at the produced ~projname-bench.prof~ file

Based on the results, we can make code changes, remove the profiling options,
regenerate ~default.nix~, and benchmark as usual in our normal Nix Shell.

* Emacs Integration

** Installing ~Dante~

If using vanilla Emacs, follow [[https://github.com/jyp/dante#installation][Dante's own installation instructions.]]

If using Spacemacs, the ~haskell~ layer on the ~develop~ branch has support for [[https://github.com/jyp/dante][Dante]],
which automatically uses ~nix~ if it detects a ~shell.nix~ and a ~default.nix~.
Our haskell layer line should look like this:

#+BEGIN_SRC lisp
  (haskell :variables haskell-completion-backend 'dante)
#+END_SRC

Now we add the following to the ~dotspacemacs/user-config~ section of our ~.spacemacs~:

#+BEGIN_SRC lisp
  (add-hook 'dante-mode-hook 'flycheck-mode)
#+END_SRC

or else Dante might not activate itself properly when opening a Haskell file.

Dante provides no REPL, and the usual ~SPC m s b~ doesn't work. To test out
some Haskell, we can do this instead:

#+BEGIN_SRC haskell
  -- >>> foo 5
  foo :: Int -> String
  foo = show
#+END_SRC

By running ~SPC m s e~ on the comment line, our code will transform into this:

#+BEGIN_SRC haskell
  -- >>> foo 5
  -- "5"
  foo :: Int -> String
  foo = show
#+END_SRC

Together with Flycheck, this (in theory) obviates the need for an actual REPL.

** Getting Dante to work with Test and Benchmark suites

Out of the box, Dante doesn't automatically handle multiple compilation targets.
By this, I mean a single ~.cabal~ that specifies a library, test suite, and
benchmark suite, say. By default, when navigating to our
test and benchmark code, Flycheck will complain that many of our
imported libraries aren't in scope.

The solution to this is to use file-local emacs variables in our test/bench
source files. We can use the emacs function ~add-file-local-variable-prop-line~ to set
~dante-target~ to the name of our test/benchmark suite names. So for a test suite
named ~vectortiles-test~, we'd see the following Haskell comment on the first
line of our ~Test.hs~ file:

#+BEGIN_SRC haskell
  -- -*- dante-target: "vectortiles-test"; -*-
#+END_SRC

Navigating to ~Test.hs~ will then boot an extra Nix'd ~cabal repl~ and flycheck
session specifically for this file.

* CI Services

Of the available choices, good ol' Travis seems to have the simplest setup.

** Travis

[[https://docs.travis-ci.com/user/languages/nix/][Official instructions here.]]

Pretty low friction. For a package named ~vectortiles~, a complete ~.travis.yml~
boils down to:

#+BEGIN_SRC yaml
  sudo: true  # Runs the build without Docker. It's *much* faster this way.
  language: nix
  script: nix-build --attr vectortiles release.nix
#+END_SRC

This setup will have our CI fail properly when tests fail. It should
run in only a few minutes, even though every dependency is redownloaded
every time.

If you're an [[https://github.com/sol/hpack][hpack]] fan and never commit your auto-generated ~.cabal~,
here's a ~.travis.yml~ that will help:

#+BEGIN_SRC yaml
  sudo: true

  language: nix

  before_install: nix-env --install --attr nixpkgs.haskellPackages.hpack

  script:
    - hpack
    - nix-build --attr vectortiles release.nix
#+END_SRC

** Hercules

[[https://github.com/hercules-ci/hercules][Github repository]].

It's a new CI system for Nix projects that aims to replace Hydra, but it still
seems [[https://github.com/hercules-ci/hercules/issues/5][distant from its 1.0 release]].

