blog/nix-en.html

<div id="outline-container-orgc7fbdab" class="outline-3">
<h3 id="orgc7fbdab"><span class="section-number-3">2.4</span> Profiling</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Nix makes this fairly easy. First, we add the following to a <code>~/.config/nixpkgs/config.nix</code>:
</p>

<div class="org-src-container">
<pre class="src src-nix"><span style="color: #3a81c3;">{</span>
  <span style="color: #715ab1;">packageOverrides</span> = super: <span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">self</span> = super.pkgs; <span style="color: #3a81c3; font-weight: bold;">in</span>
  <span style="color: #6c3163;">{</span>
    <span style="color: #715ab1;">profiledHaskellPackages</span> = self.haskellPackages.override <span style="color: #2d9574;">{</span>
      <span style="color: #715ab1;">overrides</span> = self: super: <span style="color: #67b11d;">{</span>
        <span style="color: #715ab1;">mkDerivation</span> = args: super.mkDerivation <span style="color: #b1951d;">(</span>args // <span style="color: #3a81c3;">{</span>
          <span style="color: #715ab1;">enableLibraryProfiling</span> = <span style="color: #3a81c3;">true</span>;
        <span style="color: #3a81c3;">}</span><span style="color: #b1951d;">)</span>;
      <span style="color: #67b11d;">}</span>;
    <span style="color: #2d9574;">}</span>;
  <span style="color: #6c3163;">}</span>;
<span style="color: #3a81c3;">}</span>
</pre>
</div>

<p>
Now in the project we want to profile, we create a new <code>profiling-shell.nix</code>:
</p>

<div class="org-src-container">
<pre class="src src-nix"><span style="color: #3a81c3; font-weight: bold;">let</span> <span style="color: #715ab1;">nixpkgs</span> = <span style="color: #3a81c3;">import</span> <span style="color: #4e3163;">&lt;nixpkgs&gt;</span> <span style="color: #3a81c3;">{}</span>;
    <span style="color: #715ab1;">orig</span> = nixpkgs.pkgs.profiledHaskellPackages.callPackage <span style="color: #4e3163;">./default.nix</span> <span style="color: #3a81c3;">{}</span>;
<span style="color: #3a81c3; font-weight: bold;">in</span> <span style="color: #3a81c3;">(</span>nixpkgs.pkgs.haskell.lib.doBenchmark orig<span style="color: #3a81c3;">)</span>.env
</pre>
</div>

<p>
Almost identical to our normal <code>shell.nix</code>, except for the usage of
<code>profiledHaskellPackages</code>, which we just defined globally.
Now, an invocation of <code>nix-shell profiling-shell.nix</code> will rebuild <i>every</i>
dependency in our project with profiling enabled. The first time this is done
it will take quite a long time. Luckily this doesn't corrupt our Nix store -
a vanilla <code>nix-shell</code> does seem to present us with our regular dependencies
again, without redownloading or rebuilding.
</p>

<p>
<b>WARNING:</b> A <code>nix-collect-garbage -d</code> will wipe away all the custom-built
libs from our Nix Store, and we'd have to build them again if they're needed.
</p>

<p>
If we're writing a library, the closest executable on hand that we could profile
would be our benchmark suite. To do that:
</p>

<ul class="org-ul">
<li>Add <code>-prof</code> and <code>-fprof-auto</code> to our benchmark's GHC options</li>
<li>Regenerate <code>default.nix</code></li>
<li>Enter our profiling shell: <code>nix-shell profiling-shell.nix</code></li>
<li><code>cabal configure --enable-library-profiling --enable-benchmarks</code></li>
<li><code>cabal build</code></li>
<li><code>dist/build/projname/projname-bench +RTS -p</code></li>
<li>Look at the produced <code>projname-bench.prof</code> file</li>
</ul>

<p>
Based on the results, we can make code changes, remove the profiling options,
regenerate <code>default.nix</code>, and benchmark as usual in our normal Nix Shell.
</p>
</div>
</div>
</div>

<div id="outline-container-org5a2e5f4" class="outline-2">
<h2 id="org5a2e5f4"><span class="section-number-2">3</span> Emacs Integration</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org93d0df9" class="outline-3">
<h3 id="org93d0df9"><span class="section-number-3">3.1</span> Installing <code>Dante</code></h3>
<div class="outline-text-3" id="text-3-1">
<p>
If using vanilla Emacs, follow <a href="https://github.com/jyp/dante#installation">Dante's own installation instructions.</a>
</p>

<p>
If using Spacemacs, the <code>haskell</code> layer on the <code>develop</code> branch has support for <a href="https://github.com/jyp/dante">Dante</a>,
which automatically uses <code>nix</code> if it detects a <code>shell.nix</code> and a <code>default.nix</code>.
Our haskell layer line should look like this:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span>haskell <span style="color: #3a81c3;">:variables</span> haskell-completion-backend 'dante<span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
Now we add the following to the <code>dotspacemacs/user-config</code> section of our <code>.spacemacs</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span>add-hook 'dante-mode-hook 'flycheck-mode<span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
or else Dante might not activate itself properly when opening a Haskell file.
</p>

<p>
Dante provides no REPL, and the usual <code>SPC m s b</code> doesn't work. To test out
some Haskell, we can do this instead:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #2aa1ae; background-color: #ecf3ec;">-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; foo 5</span>
<span style="color: #6c3163; font-weight: bold;">foo</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Int</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">String</span>
<span style="color: #6c3163; font-weight: bold;">foo</span> <span style="color: #715ab1;">=</span> show
</pre>
</div>

<p>
By running <code>SPC m s e</code> on the comment line, our code will transform into this:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #2aa1ae; background-color: #ecf3ec;">-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">&gt;&gt;&gt; foo 5</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">"5"</span>
<span style="color: #6c3163; font-weight: bold;">foo</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Int</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">String</span>
<span style="color: #6c3163; font-weight: bold;">foo</span> <span style="color: #715ab1;">=</span> show
</pre>
</div>

<p>
Together with Flycheck, this (in theory) obviates the need for an actual REPL.
</p>
</div>
</div>

<div id="outline-container-org6423e39" class="outline-3">
<h3 id="org6423e39"><span class="section-number-3">3.2</span> Getting Dante to work with Test and Benchmark suites</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Out of the box, Dante doesn't automatically handle multiple compilation targets.
By this, I mean a single <code>.cabal</code> that specifies a library, test suite, and
benchmark suite, say. By default, when navigating to our
test and benchmark code, Flycheck will complain that many of our
imported libraries aren't in scope.
</p>

<p>
The solution to this is to use file-local emacs variables in our test/bench
source files. We can use the emacs function <code>add-file-local-variable-prop-line</code> to set
<code>dante-target</code> to the name of our test/benchmark suite names. So for a test suite
named <code>vectortiles-test</code>, we'd see the following Haskell comment on the first
line of our <code>Test.hs</code> file:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #2aa1ae; background-color: #ecf3ec;">-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">-*- dante-target: "vectortiles-test"; -*-</span>
</pre>
</div>

<p>
Navigating to <code>Test.hs</code> will then boot an extra Nix'd <code>cabal repl</code> and flycheck
session specifically for this file.
</p>
</div>
</div>
</div>

<div id="outline-container-org5ace153" class="outline-2">
<h2 id="org5ace153"><span class="section-number-2">4</span> CI Services</h2>
<div class="outline-text-2" id="text-4">
<p>
Of the available choices, good ol' Travis seems to have the simplest setup.
</p>
</div>

<div id="outline-container-org77267d0" class="outline-3">
<h3 id="org77267d0"><span class="section-number-3">4.1</span> Travis</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<a href="https://docs.travis-ci.com/user/languages/nix/">Official instructions here.</a>
</p>

<p>
Pretty low friction. For a package named <code>vectortiles</code>, a complete <code>.travis.yml</code>
boils down to:
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #715ab1;">sudo</span>: true  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Runs the build without Docker. It's *much* faster this way.</span>
<span style="color: #715ab1;">language</span>: nix
<span style="color: #715ab1;">script</span>: nix-build --attr vectortiles release.nix
</pre>
</div>

<p>
This setup will have our CI fail properly when tests fail. It should
run in only a few minutes, even though every dependency is redownloaded
every time.
</p>

<p>
If you're an <a href="https://github.com/sol/hpack">hpack</a> fan and never commit your auto-generated <code>.cabal</code>,
here's a <code>.travis.yml</code> that will help:
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #715ab1;">sudo</span>: <span style="color: #4e3163;">true</span>

<span style="color: #715ab1;">language</span>: nix

<span style="color: #715ab1;">before_install</span>: nix-env --install --attr nixpkgs.haskellPackages.hpack

<span style="color: #715ab1;">script</span>:
  - hpack
  - nix-build --attr vectortiles release.nix
</pre>
</div>
</div>
</div>

<div id="outline-container-org8724f6b" class="outline-3">
<h3 id="org8724f6b"><span class="section-number-3">4.2</span> Hercules</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<a href="https://github.com/hercules-ci/hercules">Github repository</a>.
</p>

<p>
It's a new CI system for Nix projects that aims to replace Hydra, but it still
seems <a href="https://github.com/hercules-ci/hercules/issues/5">distant from its 1.0 release</a>.
</p>
</div>
</div>
