blog/nix-en.org
** CircleCI

CircleCI has [[https://circleci.com/docs/1.0/language-haskell/][Haskell support]], but Nix support doesn't seem to be first-class.
[[https://discuss.circleci.com/t/caching-root-directory-nix-not-working/10626][Here's some evidence]] that someone has it at least partly working.

** Self-run Hydra

[[https://nixos.org/hydra/][Official site]].

While the "native" choice for Nix, this seems way too complicated for the lay
library author.

* Comparison to Stack

I wanted to give Nix/Dante a fair shot. In terms of personal programming philosophy,
I'm motivated by high power-to-simplicity ratios (hence Haskell). After porting a
project to use Nix/Dante from Stack/Intero, here are the advantages that I see:

- Much faster "first compile" thanks to remotely cached, prebuilt libraries
  (this also affects CI runs, Heroku deploys, etc.)
- "Auto-updating" resolvers (i.e. no need to manually increment the "nightly" date)
- Simpler Travis config
- Non-haskell dependency management
- Convenient connection with [[https://github.com/sol/doctest][doctest]]. If you've added a comment that's runnable
  by Dante into a docstring, say:

#+BEGIN_SRC haskell
  -- | Very well-worded docstring here.
  --
  -- >>> inc 1
  -- 2
  inc :: Int -> Int
  inc n = n + 1
#+END_SRC

This is also the syntax that's understood by doctest as being a proof of
correctness, so future changes to ~inc~ will have to pass the test that
you originally set via a live Dante run (and not something hand-written).

And the advantages of Stack/Intero:

- Vastly simpler initial setup for Haskell beginners (i.e. just ~stack build~)
- Overall simpler project config (a minimal legal ~stack.yaml~ is one line long).
- Slightly stronger "it will always build" guarantee. A ~stack.yaml~ seems like
  a stronger constract for a sane environment when it comes to GHC and library
  versions.
- ~intero~ has a simpler setup, a REPL, better support for auto-completion, and
  [[https://github.com/commercialhaskell/intero/issues/524][auto-filling of holes]].
- ~stack~ 's various UX improvements:
  - File watching: ~stack build --haddock-deps --test --file-watch --fast~
  - Non-fiddly ~stack test~ and ~stack bench~
  - Offline docs: ~stack haddock --open foobar~
  - Dependency graphs: ~stack dot --external --prune base,ghc-prim,integer-gmp,deepseq,array | dot -Tjpg -o deps.jpg~
  - ~stack upload .~

* Resources

- [[https://nixos.org/nixpkgs/manual/#users-guide-to-the-haskell-infrastructure][Official Nix guide for Haskell packages]]
- [[https://github.com/Gabriel439/haskell-nix][Gabriel Gonzales' Nix Guide]]
- [[http://vaibhavsagar.com/blog/2018/01/03/static-haskell-nix/][Building static Haskell binaries]]
- [[https://github.com/jyp/dante][Dante Mode]] for Emacs
