blog/nix-en.html

<div id="outline-container-orgf777bc9" class="outline-3">
<h3 id="orgf777bc9"><span class="section-number-3">4.3</span> CircleCI</h3>
<div class="outline-text-3" id="text-4-3">
<p>
CircleCI has <a href="https://circleci.com/docs/1.0/language-haskell/">Haskell support</a>, but Nix support doesn't seem to be first-class.
<a href="https://discuss.circleci.com/t/caching-root-directory-nix-not-working/10626">Here's some evidence</a> that someone has it at least partly working.
</p>
</div>
</div>

<div id="outline-container-orga0d026c" class="outline-3">
<h3 id="orga0d026c"><span class="section-number-3">4.4</span> Self-run Hydra</h3>
<div class="outline-text-3" id="text-4-4">
<p>
<a href="https://nixos.org/hydra/">Official site</a>.
</p>

<p>
While the "native" choice for Nix, this seems way too complicated for the lay
library author.
</p>
</div>
</div>
</div>

<div id="outline-container-org1df93a0" class="outline-2">
<h2 id="org1df93a0"><span class="section-number-2">5</span> Comparison to Stack</h2>
<div class="outline-text-2" id="text-5">
<p>
I wanted to give Nix/Dante a fair shot. In terms of personal programming philosophy,
I'm motivated by high power-to-simplicity ratios (hence Haskell). After porting a
project to use Nix/Dante from Stack/Intero, here are the advantages that I see:
</p>

<ul class="org-ul">
<li>Much faster "first compile" thanks to remotely cached, prebuilt libraries
(this also affects CI runs, Heroku deploys, etc.)</li>
<li>"Auto-updating" resolvers (i.e. no need to manually increment the "nightly" date)</li>
<li>Simpler Travis config</li>
<li>Non-haskell dependency management</li>
<li>Convenient connection with <a href="https://github.com/sol/doctest">doctest</a>. If you've added a comment that's runnable
by Dante into a docstring, say:</li>
</ul>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #da8b55;">-- | Very well-worded docstring here.</span>
<span style="color: #da8b55;">--</span>
<span style="color: #da8b55;">-- &gt;&gt;&gt; inc 1</span>
<span style="color: #da8b55;">-- 2</span>
<span style="color: #6c3163; font-weight: bold;">inc</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Int</span> <span style="color: #715ab1;">-&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Int</span>
<span style="color: #6c3163; font-weight: bold;">inc</span> n <span style="color: #715ab1;">=</span> n <span style="color: #715ab1;">+</span> <span style="color: #4e3163;">1</span>
</pre>
</div>

<p>
This is also the syntax that's understood by doctest as being a proof of
correctness, so future changes to <code>inc</code> will have to pass the test that
you originally set via a live Dante run (and not something hand-written).
</p>

<p>
And the advantages of Stack/Intero:
</p>

<ul class="org-ul">
<li>Vastly simpler initial setup for Haskell beginners (i.e. just <code>stack build</code>)</li>
<li>Overall simpler project config (a minimal legal <code>stack.yaml</code> is one line long).</li>
<li>Slightly stronger "it will always build" guarantee. A <code>stack.yaml</code> seems like
a stronger constract for a sane environment when it comes to GHC and library
versions.</li>
<li><code>intero</code> has a simpler setup, a REPL, better support for auto-completion, and
<a href="https://github.com/commercialhaskell/intero/issues/524">auto-filling of holes</a>.</li>
<li><code>stack</code> 's various UX improvements:
<ul class="org-ul">
<li>File watching: <code>stack build --haddock-deps --test --file-watch --fast</code></li>
<li>Non-fiddly <code>stack test</code> and <code>stack bench</code></li>
<li>Offline docs: <code>stack haddock --open foobar</code></li>
<li>Dependency graphs: <code>stack dot --external --prune base,ghc-prim,integer-gmp,deepseq,array | dot -Tjpg -o deps.jpg</code></li>
<li><code>stack upload .</code></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org6fdb67e" class="outline-2">
<h2 id="org6fdb67e"><span class="section-number-2">6</span> Resources</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><a href="https://nixos.org/nixpkgs/manual/#users-guide-to-the-haskell-infrastructure">Official Nix guide for Haskell packages</a></li>
<li><a href="https://github.com/Gabriel439/haskell-nix">Gabriel Gonzales' Nix Guide</a></li>
<li><a href="http://vaibhavsagar.com/blog/2018/01/03/static-haskell-nix/">Building static Haskell binaries</a></li>
<li><a href="https://github.com/jyp/dante">Dante Mode</a> for Emacs</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-01-10</p>
<p class="author">Author: Colin</p>
<p class="date">Created: 2018-02-22 Thu 15:41</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>